In [1]:
#1 ¿Qué diferencia hay entre una Serie y un DataFrame?

print('Una serie es un array unidimensional que tiene dos tipos de valores, índice y vector, mientras que un dataframe tiene dos dimensiones y en él pueden guardarse todo tipo de datos.')

# Momento de trabajar con Series. Contestad a las siguientes preguntas:

Una serie es un array unidimensional que tiene dos tipos de valores, índice y vector, mientras que un dataframe tiene dos dimensiones y en él pueden guardarse todo tipo de datos.

In [2]:
# Importamos las librerías:

import pandas as pd
import numpy as np
import random
import os
from os import getcwd

In [3]:
# Crea dos listas:
# Una que se llame "valores" que tenga 7 números aleatorios.

def lista_generador(n):
      lista = [0]  * n
      for i in range(n):
          lista[i] = random.randint(0, 100)
      return lista

valores = lista_generador(7)

# Otra que se llame "indices" que tenga 7 strings que se llamen como los días de la semana.

indices = ['lunes', 'martes', 'miercoles', 'jueves', 'viernes', 'sábado', 'domingo']

In [4]:
# A partir de estas dos listas cread una Serie donde la variable "valores" sean los valores de la Serie
# y la variable indices sean los índices de la Serie.

serie1 = pd.Series(valores, indices)

In [5]:
serie1

lunes        41
martes       24
miercoles    52
jueves       52
viernes      16
sábado       74
domingo      87
dtype: int64

In [6]:
# A partir de las dos listas anteriores cread un diccionario usando un bucle for. Para hacer esto tenemos
# el método zip que nos permite iterar por dos listas a la vez.

diccionario = {}

for i,z in zip(indices, valores):
    print(i, z) # Dejamos esta línea a modo de comprobación.
    diccionario[i] = z


print('El diccionario nos queda tal que así:', diccionario)

lunes 41
martes 24
miercoles 52
jueves 52
viernes 16
sábado 74
domingo 87
El diccionario nos queda tal que así: {'lunes': 41, 'martes': 24, 'miercoles': 52, 'jueves': 52, 'viernes': 16, 'sábado': 74, 'domingo': 87}

In [7]:
# Crea una Serie con el diccionario creado en el punto anterior.

serie1 = pd.Series(diccionario)
print(serie1)

# ¿Qué forma tiene esta última Serie?
# ¿Qué tipo de datos tiene?
# ¿Qué tamaño tiene?
# ¿Cuáles son los índices de la Serie?
# ¿Y los values?

def propiedades(nuestro_array):
    print(f'La forma de nuestro array es', nuestro_array.shape)
    print(f'El tipo de nuestro array es', nuestro_array.dtype)
    print(f'El tamaño de nuestro array es', nuestro_array.size)
    print(f'Los índices de nuestra serie son', nuestro_array.index)
    print(f'Los values de nuestra serie son', nuestro_array.values)

propiedades(serie1)

lunes        41
martes       24
miercoles    52
jueves       52
viernes      16
sábado       74
domingo      87
dtype: int64
La forma de nuestro array es (7,)
El tipo de nuestro array es int64
El tamaño de nuestro array es 7
Los índices de nuestra serie son Index(['lunes', 'martes', 'miercoles', 'jueves', 'viernes', 'sábado',
       'domingo'],
      dtype='object')
Los values de nuestra serie son [41 24 52 52 16 74 87]

In [31]:
# Extraed el valor para el índice "lunes".

print(serie1['lunes'])

# Extraed el valor para el índice "lunes", "martes" y "miércoles".

print(serie1[0:3])


# Extraed el valor para el índice "lunes" y "domingo".

# Preguntamos duda
print('Lunes y domingo:', serie1[["lunes","domingo"]])

41
lunes        41
martes       24
miercoles    52
dtype: int64
Lunes y domingo: lunes      41
domingo    87
dtype: int64

In [9]:
# Es el turno de los DataFrames

In [10]:
# Cread un array de dos dimensiones con 4 filas y 3 columnas.

array1 = np.random.rand(4, 3)
array1

array([[0.57085379, 0.88177577, 0.21897746],
       [0.64714078, 0.0146163 , 0.224121  ],
       [0.7660402 , 0.64003948, 0.42203723],
       [0.91746588, 0.83997405, 0.30513979]])

In [11]:
# Convertid el array en un DataFrame donde las columnas se llamen "España", "Francia" e "Italia".

dataframe1 = pd.DataFrame(array1, columns = ["España", "Francia", "Italia"])
dataframe1

     España   Francia    Italia
0  0.570854  0.881776  0.218977
1  0.647141  0.014616  0.224121
2  0.766040  0.640039  0.422037
3  0.917466  0.839974  0.305140

In [12]:
# Descargad el archivo "medallas" y cargad el DataFrame:

miruta = os.getcwd()
miruta

'/mnt/c/Users/kuska/Documents/AnaAdalab/modulo-02/00-pair/DA-promoC-modulo-02-Marina-Lourdes-Ana/Pandas'

In [13]:
nuestro_df = pd.read_csv("01-medallas.csv", index_col = ["País"])

In [14]:
nuestro_df

                 Unnamed: 0   Oro  Plata  Bronce
País
China                     1  1473    994     720
Japón                     2  1032   1037     985
Corea del Sur             3   745    663     827
Irán                      4   179    181     197
Kazajistán                5   155    158     224
India                     6   154    202     315
Tailandia                 7   132    175     278
Indonesia                 8   112    131     240
China Taipéi              9    99    144     276
Corea del Norte          10    91    120     235

In [15]:
# Usando el loc extraed todas las columnas de la fila.
    # Elegimos la fila "China".

nuestro_df.loc["Tailandia"] #?? Con [:, "China"] nos da error

Unnamed: 0      7
Oro           132
Plata         175
Bronce        278
Name: Tailandia, dtype: int64

In [16]:
# Usando el loc extraed todas las columnas de China e Irán.

nuestro_df.loc[["China","Irán"]]

       Unnamed: 0   Oro  Plata  Bronce
País
China           1  1473    994     720
Irán            4   179    181     197

In [17]:
# Usando el loc extraed solo las columnas de "Oro", "Plata" y "Bronce" de China e Irán.

nuestro_df.loc[["China", "Irán"], ["Oro", "Plata", "Bronce"]]

        Oro  Plata  Bronce
País
China  1473    994     720
Irán    179    181     197

In [18]:
# Usando el iloc extraed la información de la India. Devolved todas las columnas.

nuestro_df.iloc[5]

Unnamed: 0      6
Oro           154
Plata         202
Bronce        315
Name: India, dtype: int64

In [19]:
# Usando el iloc extraed todas las columnas de los paises que estén en posición impar.

nuestro_df.iloc[0::2]

               Unnamed: 0   Oro  Plata  Bronce
País
China                   1  1473    994     720
Corea del Sur           3   745    663     827
Kazajistán              5   155    158     224
Tailandia               7   132    175     278
China Taipéi            9    99    144     276

In [20]:
# La primera que nos tendría que salir es Japón y la última Corea del Norte.

    # Dos formas, primera:
    
nuestro_df.iloc[1::]

                 Unnamed: 0   Oro  Plata  Bronce
País
Japón                     2  1032   1037     985
Corea del Sur             3   745    663     827
Irán                      4   179    181     197
Kazajistán                5   155    158     224
India                     6   154    202     315
Tailandia                 7   132    175     278
Indonesia                 8   112    131     240
China Taipéi              9    99    144     276
Corea del Norte          10    91    120     235

In [21]:
    # Segunda:

nuestro_df.iloc[1:10]

                 Unnamed: 0   Oro  Plata  Bronce
País
Japón                     2  1032   1037     985
Corea del Sur             3   745    663     827
Irán                      4   179    181     197
Kazajistán                5   155    158     224
India                     6   154    202     315
Tailandia                 7   132    175     278
Indonesia                 8   112    131     240
China Taipéi              9    99    144     276
Corea del Norte          10    91    120     235

In [22]:
# Utilizando el código del ejercicio anterior, seleccionad unicamente las columnas "Oro", "Plata" y "Bronce".
# Contestad a las siguientes preguntas:

In [23]:
# ¿Qué país consiguió más de 200 medallas de oro?

print('El país que consiguió más de 200 medallas de oro fue', nuestro_df.loc[nuestro_df.Oro>200])

El país que consiguió más de 200 medallas de oro fue                Unnamed: 0   Oro  Plata  Bronce
País
China                   1  1473    994     720
Japón                   2  1032   1037     985
Corea del Sur           3   745    663     827

In [24]:
# ¿Qué país consiguió más de 200 medallas de oro y más de 1000 de plata?

print('El país que consiguió más de 200 medallas de oro y más de 1000 de plata fue', nuestro_df.loc[(nuestro_df.Oro>200) & (nuestro_df.Plata>1000)])

El país que consiguió más de 200 medallas de oro y más de 1000 de plata fue        Unnamed: 0   Oro  Plata  Bronce
País
Japón           2  1032   1037     985

In [25]:
# ¿Qué país consiguió más de 200 medallas de oro o más de 700 de bronce?

print('El país que consiguió má s de 200 medallas de oro y más de 1000 de plata fue', nuestro_df.loc[(nuestro_df.Oro>200) | (nuestro_df.Bronce>700)])

El país que consiguió má s de 200 medallas de oro y más de 1000 de plata fue                Unnamed: 0   Oro  Plata  Bronce
País
China                   1  1473    994     720
Japón                   2  1032   1037     985
Corea del Sur           3   745    663     827

In [26]:
# Como vemos hay una columna que se llama Unnamed: 0 que no nos interesa. Eliminad esa columna.

nuestro_df_sin_unnamed = nuestro_df.drop('Unnamed: 0', axis = 1)
nuestro_df_sin_unnamed

                  Oro  Plata  Bronce
País
China            1473    994     720
Japón            1032   1037     985
Corea del Sur     745    663     827
Irán              179    181     197
Kazajistán        155    158     224
India             154    202     315
Tailandia         132    175     278
Indonesia         112    131     240
China Taipéi       99    144     276
Corea del Norte    91    120     235

In [27]:
# Cread una nueva columma que se llame "total" que sea el resultado de la suma de todas las
#  medallas obtenidas por cada país.

nuestro_df_sin_unnamed['Total'] = (nuestro_df["Oro"] + nuestro_df["Plata"] + nuestro_df["Plata"])

In [28]:
nuestro_df_sin_unnamed

                  Oro  Plata  Bronce  Total
País
China            1473    994     720   3461
Japón            1032   1037     985   3106
Corea del Sur     745    663     827   2071
Irán              179    181     197    541
Kazajistán        155    158     224    471
India             154    202     315    558
Tailandia         132    175     278    482
Indonesia         112    131     240    374
China Taipéi       99    144     276    387
Corea del Norte    91    120     235    331